# -----------------------------------------------
# 🔸 VampireMusic Project
# 🔹 Developed & Maintained by: Vampire Bots (https://github.com/TEAM-VAMPIRE-OP)
# 📅 Copyright © 2025 – All Rights Reserved
#
# 📖 License:
# This source code is open for educational and non-commercial use ONLY.
# You are required to retain this credit in all copies or substantial portions of this file.
# Commercial use, redistribution, or removal of this notice is strictly prohibited
# without prior written permission from the author.
#
# ❤️ Made with dedication and love by TEAM-VAMPIRE-OP
# -----------------------------------------------

HELP_1 = """<b><u>⊚ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs :</u></b>

<blockquote>ᴊᴜsᴛ ᴀᴅᴅ <b>ᴄ</b> ɪɴ ᴛʜᴇ sᴛᴀʀᴛɪɴɢ ᴏғ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ᴛᴏ ᴜsᴇ ᴛʜᴇᴍ ғᴏʀ ᴄʜᴀɴɴᴇʟ.</blockquote>

<blockquote>/pause : ᴩᴀᴜsᴇ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴩʟᴀʏɪɴɢ sᴛʀᴇᴀᴍ.<br>
/resume : ʀᴇsᴜᴍᴇ ᴛʜᴇ ᴩᴀᴜsᴇᴅ sᴛʀᴇᴀᴍ.<br>
/skip : sᴋɪᴩ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴛʀᴀᴄᴋ ᴀɴᴅ ᴘʟᴀʏ ɴᴇxᴛ ɪɴ ǫᴜᴇᴜᴇ.<br>
/end or /stop : ᴄʟᴇᴀʀs ǫᴜᴇᴜᴇ ᴀɴᴅ sᴛᴏᴩs sᴛʀᴇᴀᴍ.<br>
/queue : sʜᴏᴡs ǫᴜᴇᴜᴇᴅ ᴛʀᴀᴄᴋs.<br>
/loop [ᴅɪsᴀʙʟᴇ/ᴇɴᴀʙʟᴇ] ᴏʀ [1:10] : ʟᴏᴏᴘ ᴄᴜʀʀᴇɴᴛ sᴏɴɢ.<br>
/shuffle : sʜᴜғғʟᴇs ǫᴜᴇᴜᴇ.<br>
/seek : sᴇᴇᴋ ᴛᴏ ɢɪᴠᴇɴ ᴛɪᴍᴇ.<br>
/seekback : ʙᴀᴄᴋᴡᴀʀᴅ sᴇᴇᴋ ᴛᴏ ɢɪᴠᴇɴ ᴛɪᴍᴇ.<br>
/speed or /playback : ᴀᴅᴊᴜsᴛ ᴘʟᴀʏʙᴀᴄᴋ sᴘᴇᴇᴅ.</blockquote>
"""

HELP_2 = """<b><u>⊚ ᴀᴜᴛʜ ᴜsᴇʀs :</u></b>

<blockquote><b>➻ ᴀᴜᴛʜ ᴜsᴇʀs</b> ᴄᴀɴ ᴜsᴇ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ᴡɪᴛʜᴏᴜᴛ ʙᴇɪɴɢ ᴀ ɢʀᴏᴜᴩ ᴀᴅᴍɪɴ.</blockquote>

<blockquote>/auth [ᴜsᴇʀɴᴀᴍᴇ/ɪᴅ] : ᴀᴅᴅ ᴛᴏ ᴀᴜᴛʜ ʟɪsᴛ.<br>
/unauth [ᴜsᴇʀɴᴀᴍᴇ/ɪᴅ] : ʀᴇᴍᴏᴠᴇ ᴀᴜᴛʜ ᴜsᴇʀ.<br>
/authusers : sʜᴏᴡ ᴀᴜᴛʜ ᴜsᴇʀs ʟɪsᴛ.</blockquote>
"""

HELP_3 = """<u><b>⊚ ʙʀᴏᴀᴅᴄᴀsᴛ ғᴇᴀᴛᴜʀᴇ</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]:

<blockquote>/broadcast [ᴍᴇssᴀɢᴇ ᴏʀ ʀᴇᴩʟʏ] : sᴇɴᴅ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs.</blockquote>

<blockquote><b><u>➻ ᴍᴏᴅᴇs :</u></b><br>
-pin : ᴩɪɴ ᴛʜᴇ ᴍᴇssᴀɢᴇ<br>
-pinloud : ᴩɪɴ + ɴᴏᴛɪғʏ ᴍᴇᴍʙᴇʀs<br>
-user : ʙʀᴏᴀᴅᴄᴀsᴛ ᴛᴏ sᴛᴀʀᴛᴇᴅ ᴜsᴇʀs<br>
-assistant : sᴇɴᴅ ᴠɪᴀ ᴀssɪsᴛᴀɴᴛ<br>
-nobot : ᴅᴏɴ'ᴛ sᴇɴᴅ ғʀᴏᴍ ʙᴏᴛ</blockquote>

<b>⊚ Example :</b> <code>/broadcast -user -pin Testing broadcast</code>
"""

HELP_4 = """<u><b>⊚ ʙʟᴀᴄᴋʟɪsᴛ & ʙʟᴏᴄᴋ:</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

<blockquote>/blacklistchat [ɪᴅ] : ʙᴀɴ ᴄʜᴀᴛ<br>
/whitelistchat [ɪᴅ] : ᴜɴʙᴀɴ ᴄʜᴀᴛ<br>
/blacklistedchat : sʜᴏᴡ ʙʟᴀᴄᴋʟɪsᴛ</blockquote>

<u><b>⊚ ʙʟᴏᴄᴋ ᴜsᴇʀs :</b></u>

<blockquote>/block [ᴜsᴇʀ] : ᴘʀᴇᴠᴇɴᴛ ᴜsᴇʀ ᴄᴏᴍᴍᴀɴᴅs<br>
/unblock [ᴜsᴇʀ] : ᴀʟʟᴏᴡ ᴛʜᴇᴍ ᴀɢᴀɪɴ<br>
/blockedusers : sʜᴏᴡ ʙʟᴏᴄᴋᴇᴅ ᴜsᴇʀs</blockquote>
"""

HELP_5 = """<u><b>⊚ ᴩʟᴀʏ & ᴄʜᴀɴɴᴇʟ ᴩʟᴀʏ :</b></u>

<blockquote>/play or /vplay : ᴘʟᴀʏ ᴀᴜᴅɪᴏ/ᴠɪᴅᴇᴏ<br>
/playforce or /vplayforce : ғᴏʀᴄᴇ ᴩʟᴀʏ<br>
/song : sᴇᴀʀᴄʜ & ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ɪɴ ᴀᴜᴅɪᴏ/ᴠɪᴅᴇᴏ ғᴏʀᴍᴀᴛ</blockquote>

<u><b>⊚ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ :</b></u>

<blockquote>/cplay : ᴘʟᴀʏ ᴀᴜᴅɪᴏ ɪɴ ᴄʜᴀɴɴᴇʟ<br>
/cvplay : ᴘʟᴀʏ ᴠɪᴅᴇᴏ ɪɴ ᴄʜᴀɴɴᴇʟ<br>
/cplayforce or /cvplayforce : ғᴏʀᴄᴇ ᴘʟᴀʏ ɪɴ ᴄʜᴀɴɴᴇʟ<br>
/channelplay [ɪᴅ|ᴜsᴇʀɴᴀᴍᴇ|disable] : ʟɪɴᴋ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜ ɢʀᴏᴜᴩ</blockquote>
"""

HELP_6 = """<u><b>⊚ ɢʟᴏʙᴀʟ ʙᴀɴ :</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

<blockquote>/gban [ᴜsᴇʀ] : ɢʟᴏʙᴀʟ ʙᴀɴ ᴛʜᴇ ᴜsᴇʀ<br>
/ungban [ᴜsᴇʀ] : ᴜɴʙᴀɴ ᴛʜᴇ ᴜsᴇʀ<br>
/gbannedusers : sʜᴏᴡ ᴛʜᴇ ʙᴀɴɴᴇᴅ ᴜsᴇʀs</blockquote>
"""

HELP_7 = """<b><u>⊚ ᴀᴄᴛɪᴠᴇ ᴠᴏɪᴄᴇ/ᴠɪᴅᴇᴏᴄʜᴀᴛs :</u></b>

<blockquote>/activevoice : ʟɪsᴛ ᴏғ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs<br>
/activevideo : ʟɪsᴛ ᴏғ ᴠɪᴅᴇᴏ ᴄʜᴀᴛs<br>
/ac : ʙᴏᴛʜ ᴠᴏɪᴄᴇ + ᴠɪᴅᴇᴏ<br>
/autoend [enable|disable] : sᴛᴏᴘ ɪғ ɴᴏ ʟɪsᴛᴇɴᴇʀ</blockquote>
"""

HELP_8 = """<u><b>⊚ ᴍᴀɪɴᴛᴇɴᴀɴᴄᴇ ᴍᴏᴅᴇ :</b></u> [ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

<blockquote>/logs : ɢᴇᴛ ʟᴏɢs<br>
/logger [enable|disable] : ᴀᴄᴛɪᴠɪᴛʏ ʟᴏɢɢɪɴɢ<br>
/maintenance [enable|disable] : ᴛᴏɢɢʟᴇ ᴍᴀɪɴᴛᴇɴᴀɴᴄᴇ</blockquote>
"""

HELP_9 = """<b><u>⊚ ʙᴀsɪᴄ ᴄᴏᴍᴍᴀɴᴅs :</u></b>

<blockquote>/start : sᴛᴀʀᴛ ʙᴏᴛ<br>
/help : ʜᴇʟᴘ ᴍᴇɴᴜ<br>
/ping : ᴘɪɴɢ ᴀɴᴅ sʏsᴛᴇᴍ sᴛᴀᴛs<br>
/reboot : ʀᴇʙᴏᴏᴛ ʙᴏᴛ<br>
/settings : ɢʀᴏᴜᴩ sᴇᴛᴛɪɴɢs<br>
/sudolist : sᴜᴅᴏ ᴜsᴇʀs<br>
/restart : ʀᴇsᴛᴀʀᴛ ʙᴏᴛ<br>
/stats : ʙᴏᴛ sᴛᴀᴛɪsᴛɪᴄs</blockquote>
"""

HELP_10 = """<b><u>⊚ ɢʀᴏᴜᴘ ᴍᴀss ᴀᴄᴛɪᴏɴ ᴄᴏᴍᴍᴀɴᴅs :</u></b>

<blockquote>
/ban : ʙᴀɴ ᴀ ᴜsᴇʀ ғʀᴏᴍ ᴛʜᴇ ᴄʜᴀᴛ<br>
/unban : ᴜɴʙᴀɴ ᴀ ᴜsᴇʀ ғʀᴏᴍ ᴛʜᴇ ᴄʜᴀᴛ<br>
/kickme : sᴇʟғ-ʙᴀɴ / ʟᴇᴀᴠᴇ ᴛʜᴇ ᴄʜᴀᴛ<br>
/banall : ʙᴀɴ ᴀʟʟ ᴜsᴇʀs ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ<br>
/unbanall : ᴜɴʙᴀɴ ᴀʟʟ ᴜsᴇʀs ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ<br>
/muteall : ᴍᴜᴛᴇ ᴀʟʟ ɴᴏɴ-ᴀᴅᴍɪɴs<br>
/unmuteall : ᴜɴᴍᴜᴛᴇ ᴀʟʟ ɴᴏɴ-ᴀᴅᴍɪɴs<br>
/joinmode : sᴡɪᴛᴄʜ ᴀᴜᴛᴏ/ᴍᴀɴᴜᴀʟ ᴀᴘᴘʀᴏᴠᴀʟ ᴍᴏᴅᴇ
</blockquote>
<u><b>⊚ ᴇxᴛʀᴀ ᴜsᴇʀ's ᴄᴏᴍᴍᴀɴᴅs :</b></u>

<blockquote>
/afk ᴏʀ /bye : sᴇᴛ ᴀғᴋ sᴛᴀᴛᴜs ɪғ ʏᴏᴜ'ʀᴇ ᴏғғʟɪɴᴇ<br>
/id : ɢᴇᴛ ᴜsᴇʀ / ᴄʜᴀᴛ / ʙᴏᴛ ɪᴅ<br>
/info ᴏʀ /whois : ɢᴇᴛ ᴜsᴇʀ ᴘʀᴏғɪʟᴇ ɪɴғᴏ<br>
/sg : sᴇᴇ ᴀʟʟ ᴘᴀsᴛ ɪɴᴛᴇʀᴀᴄᴛɪᴏɴs<br>
/tgm : ᴜᴘʟᴏᴀᴅ ᴍᴇᴅɪᴀ/ᴘʜᴏᴛᴏ ᴛᴏ ᴄᴀᴛʙᴏx ʟɪɴᴋ<br>
/random : ɢᴇᴛ ᴀ ʀᴀɴᴅᴏᴍ ɪᴍᴀɢᴇ
</blockquote>
"""

